avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/main.c
/*
 * @brief Callback function usr_mlme_start_conf
 *
 * @param status        Result of requested start operation
 */
#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
	if (status == MAC_SUCCESS) {
		coord_state = COORD_RUNNING;
#ifdef SIO_HUB
#ifdef BEACON_SUPPORT
		printf("\r\nStarted beacon-enabled network in Channel - %d\r\n",
				current_channel);
#else
		printf("\r\nStarted No beacon network in Channel - %d\r\n",
				current_channel);
#endif
#endif

		/*
		 * Network is established.
		 * Waiting for association indication from a device.
		 * -> usr_mlme_associate_ind
		 */
		LED_On(LED_NWK_SETUP);

		/*
		 * Now that the network has been started successfully,
		 * the timer for broadcast data transmission is started.
		 * This is independent from the actual number of associated
		 * nodes.
		 */

		/* Start timer to initiate broadcast data transmission. */
		sw_timer_start(APP_TIMER_BC_DATA,
				((uint32_t)APP_BC_DATA_DURATION_MS * 1000),
				SW_TIMEOUT_RELATIVE,
				(FUNC_PTR)bc_data_cb,
				NULL);

		/*
		 * Now that the network has been started successfully,
		 * the timer for updating the beacon payload is started.
		 */
		sw_timer_start(APP_TIMER_BCN_PAYLOAD_UPDATE,
				((uint32_t)APP_BCN_PAYLOAD_DURATION_MS * 1000),
				SW_TIMEOUT_RELATIVE,
				(FUNC_PTR)bcn_payload_update_cb,
				NULL);
	} else {
		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}

#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 *
 * @return void
 *
 */

void usr_mlme_sync_loss_ind(uint8_t LossReason,
		uint16_t PANId,
		uint8_t LogicalChannel,
		uint8_t ChannelPage)
{
}

/*
 * @brief Application specific function to assign a short address
 *
 */
#ifdef SIO_HUB
const char Display_Associated_Device[] = "Device %u associated\r\n";
#endif
static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16)
{
	uint8_t i;
#ifdef SIO_HUB
	/*char sio_array[255];*/
#endif

	/* Check if device has been associated before */
	for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++) {
		if (device_list[i].short_addr == 0x0000) {
			/* If the short address is 0x0000, it has not been used
			 * before */
			continue;
		}

		if (device_list[i].ieee_addr == addr64) {
			/* Assign the previously assigned short address again */
			*addr16 = device_list[i].short_addr;
			return true;
		}
	}

	for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++) {
		if (device_list[i].short_addr == 0x0000) {
			*addr16 = CPU_ENDIAN_TO_LE16(i + 0x0001);
			device_list[i].short_addr = CPU_ENDIAN_TO_LE16(
					i + 0x0001);                    /* get
			                                                 * next
			                                                 * short
			                                                 *
			                                                 *
			                                                 *
			                                                 *
			                                                 *address
			                                                 **/
			device_list[i].ieee_addr = addr64; /* store extended
			                                    * address */
			no_of_assoc_devices++;
#ifdef SIO_HUB
			printf(Display_Associated_Device, (i + 1));
#endif

			return true;
		}
	}

	/* If we are here, no short address could be assigned. */
	return false;
}

/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
	while (1) {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

/*
 * @brief Callback function for initiation of broadcast data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
#ifdef SIO_HUB
const char Display_Broadcast_Tx_Count[] = "Broadcast frame Tx count:  %lu\r\n";
#endif
static void bc_data_cb(void *parameter)
{
	/* Store the current MSDU handle to be used for a broadcast data frame.
	**/
	static uint8_t curr_msdu_handle_temp;
	uint8_t src_addr_mode;
#ifndef GPIO_PUSH_BUTTON_0
	wpan_addr_spec_t dst_addr;
#endif
	uint8_t payload;
#ifdef SIO_HUB
	/*char sio_array[255];*/
#endif

	/*
	 * Request transmission of broadcast data to all devices.
	 *
	 * Since this is a beacon-enabled network,
	 * this request will just queue this frame into the broadcast data
	 * queue.
	 *
	 * Once this the next beacon frame is about to be transmitted,
	 * the broadcast data frame will be announced by setting
	 * the frame pending bit of the frame control field of this particular
	 * beacon frame.
	 *
	 * Immediately after the successful transmission of the beacon frame,
	 * the pending broadcast frame will be transmitted.
	 */
	src_addr_mode = WPAN_ADDRMODE_SHORT;
	dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
	dst_addr.PANId = DEFAULT_PAN_ID;
	/* Broadcast destination address is used. */
	dst_addr.Addr.short_address = BROADCAST;

	payload = (uint8_t)rand(); /* Any dummy data */
	curr_msdu_handle_temp++;     /* Increment handle */
	tx_cnt++;

#ifdef SIO_HUB
	printf(Display_Broadcast_Tx_Count, tx_cnt);
#endif

	/* The transmission is direct, but without acknowledgment. */
	if (wpan_mcps_data_req(src_addr_mode,
			&dst_addr,
			1,     /* One octet */
			&payload,
			curr_msdu_handle_temp,
			WPAN_TXOPT_OFF
#if (defined MAC_SECURITY_ZIP) || (defined MAC_SECURITY_2006)
			, 0, NULL, 0, 0
#endif
			)
			) {
		/*		LED_On(LED_DATA); */
	} else {
		/*
		 * Data could not be queued into the broadcast queue.
		 * Add error handling if required.
		 */
	}

